# Create a 100MHz clock on i_clk with a 10ns period (50% duty cycle)
create_clock -name i_clk -period 10 -waveform {0 5} [get_ports i_clk]

# Set clock transition (rise/fall) to 0.4 ns and clock uncertainty to 0.01 ns
set_clock_transition -rise 0.4 [get_clocks i_clk]
set_clock_transition -fall 0.4 [get_clocks i_clk]
set_clock_uncertainty 0.01 [get_clocks i_clk]

# specify the maximum delay with respect to the clock.
set_input_delay -max 1.0 -clock [get_clocks i_clk] [get_ports i_reset]
set_input_delay -max 1.0 -clock [get_clocks i_clk] [get_ports mem_res_port1]
set_input_delay -max 1.0 -clock [get_clocks i_clk] [get_ports mem_res_port2]

# Output delay constraints:
# For signals generated by the design going off-chip.
set_output_delay -max 1.0 -clock [get_clocks i_clk] [get_ports mem_req_port1]
set_output_delay -max 1.0 -clock [get_clocks i_clk] [get_ports mem_req_port2]


# All Delays
#set_input_delay -max 1 [all_inputs]
#set_output_delay -max 1 [all_outputs]
#set_max_delay 5 -from [all_inputs] -to [all_outputs]

