# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.18-s082_1 on Fri Apr 04 21:46:11 EDT 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1fF
set_units -time 1000ps

# Set the current design
current_design rapid_x_cpu

create_clock -name "i_clk" -period 10.0 -waveform {0.0 5.0} [get_ports i_clk]
set_clock_transition 0.4 [get_clocks i_clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports i_reset]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports i_clk]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports i_reset]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[ready]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][127]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][126]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][125]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][124]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][123]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][122]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][121]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][120]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][119]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][118]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][117]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][116]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][115]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][114]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][113]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][112]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][111]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][110]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][109]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][108]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][107]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][106]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][105]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][104]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][103]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][102]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][101]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][100]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][99]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][98]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][97]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][96]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][95]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][94]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][93]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][92]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][91]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][90]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][89]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][88]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][87]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][86]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][85]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][84]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][83]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][82]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][81]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][80]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][79]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][78]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][77]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][76]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][75]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][74]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][73]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][72]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][71]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][70]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][69]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][68]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][67]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][66]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][65]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][64]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][63]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][62]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][61]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][60]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][59]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][58]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][57]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][56]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][55]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][54]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][53]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][52]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][51]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][50]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][49]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][48]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][47]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][46]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][45]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][44]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][43]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][42]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][41]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][40]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][39]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][38]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][37]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][36]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][35]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][34]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][33]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][32]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][31]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][30]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][29]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][28]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][27]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][26]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][25]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][24]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][23]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][22]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][21]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][20]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][19]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][18]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][17]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][16]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][15]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][14]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][13]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][12]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][11]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][10]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][9]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][8]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][7]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][6]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][5]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][4]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][3]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][2]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][1]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port1[data][0]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[ready]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][127]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][126]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][125]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][124]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][123]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][122]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][121]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][120]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][119]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][118]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][117]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][116]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][115]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][114]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][113]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][112]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][111]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][110]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][109]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][108]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][107]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][106]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][105]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][104]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][103]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][102]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][101]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][100]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][99]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][98]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][97]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][96]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][95]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][94]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][93]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][92]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][91]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][90]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][89]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][88]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][87]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][86]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][85]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][84]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][83]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][82]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][81]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][80]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][79]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][78]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][77]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][76]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][75]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][74]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][73]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][72]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][71]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][70]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][69]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][68]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][67]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][66]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][65]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][64]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][63]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][62]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][61]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][60]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][59]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][58]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][57]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][56]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][55]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][54]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][53]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][52]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][51]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][50]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][49]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][48]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][47]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][46]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][45]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][44]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][43]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][42]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][41]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][40]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][39]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][38]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][37]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][36]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][35]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][34]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][33]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][32]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][31]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][30]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][29]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][28]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][27]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][26]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][25]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][24]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][23]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][22]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][21]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][20]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][19]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][18]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][17]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][16]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][15]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][14]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][13]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][12]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][11]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][10]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][9]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][8]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][7]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][6]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][5]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][4]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][3]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][2]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][1]}]
set_driving_cell -lib_cell INV_X2 -library NangateOpenCellLibrary -pin "ZN" [get_ports {mem_res_port2[data][0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.1 [get_clocks i_clk]
set_clock_uncertainty -hold 0.1 [get_clocks i_clk]
